Repository: Aalto-LeTech/jsvee
Catalog: messages_*.po
Languages: fi

source: - failed!
fi: - epäonnistui!

source: - ready.
fi: - valmis.

source: A reference to an object, which is in the memory at location {0}
fi: Viittaus olioon, joka on muistissa kohdassa {0}

source: Assigning parameter values to the parameter variables
fi: Sijoitetaan parametrien arvo parametrimuuttujiin

source: Assigning value to the dictionary
fi: Sijoitetaan arvo hakemistoon

source: Assigning value to the instance variable {0}
fi: Sijoitetaan arvo ilmentymämuuttujaan {0}

source: Assigning value to the list
fi: Sijoitetaan arvo listaan

source: Assigning value to the parameter variable
fi: Sijoitetaan arvo parametrimuuttujaan

source: Assigning value to the variable {0}
fi: Sijoitetaan arvo muuttujaan {0}

source: Assigning values to the instance variables
fi: Sijoitetaan arvot ilmentymämuuttujiin

source: Class {0}
fi: Luokka {0}

source: Condition is false, moving to the line {0}
fi: Ehto on epätosi, siirrytään riville {0}

source: Condition is true, moving to the line {0}
fi: Ehto on tosi, siirrytään riville {0}

source: Creating a new dictionary
fi: Luodaan uusi hakemisto

source: Creating a new instance variable {0}
fi: Luodaan uusi ilmentymämuuttuja {0}

source: Creating a new list
fi: Luodaan uusi lista

source: Creating a new variable {0}
fi: Luodaan uusi muuttuja {0}

source: Creating a new {0} array
fi: Luodaan uusi {0}-taulukko

source: Creating a new {0} object
fi: Luodaan uusi {0}-olio

source: Creating the instance variables
fi: Luodaan ilmentymämuuttujat

source: Creating the parameter variables
fi: Luodaan parametrimuuttujat

source: Defining function {0}
fi: Määritellään funktio {0}

source: End of the animation.
fi: Saavuttiin animaation loppuun.

source: Ending the call
fi: Päätetään kutsu

source: Evaluating the built-in function {0}
fi: Suoritetaan sisäänrakennettu funktio {0}.

source: Evaluating the built-in method {0}
fi: Suoritetaan sisäänrakennettu metodi {0}

source: Evaluating the operator {0}
fi: Suoritetaan operaattori {0}

source: Evaluating the type cast operator {0}
fi: Suoritetaan operaattori {0}

source: Evaluation area
fi: Evaluointialue

source: Evaluation area, expressions will be evaluated here
fi: Evaluointialue, lausekkeet evaluoidaan täällä

source: Fetching a reference to an object, which is in the memory at location {0}
fi: Noudetaan viittaus olioon, joka on muistissa kohdassa {0}

source: Fetching the function {0}
fi: Noudetaan funktio {0}

source: Fetching the method {0}
fi: Noudetaan metodi {0}

source: Fetching the next value of the collection
fi: Noudetaan kokoelman seuraava alkio

source: Fetching the operator {0}
fi: Noudetaan operaattori {0}

source: Fetching the type cast operator {0}
fi: Noudetaan operaattori {0}

source: Fetching value by the key
fi: Noudetaan arvo avaimella

source: Fetching value from the instance variable {0}
fi: Noudetaan arvo ilmentymämuuttujasta {0}

source: Fetching value from the list
fi: Noudetaan arvo listasta

source: Fetching value from the variable {0}
fi: Noudetaan arvo muuttujasta {0}

source: Fetching value {0}
fi: Noudetaan arvo {0}

source: Finished the iteration, moving to the line {0}
fi: Läpikäynti on valmis, siirrytään riville {0}

source: Function {0}
fi: Funktio {0}

source: Initializing the collection
fi: Alustetaan kokoelma

source: Literals
fi: Literaalit

source: Method {0}
fi: Metodi {0}

source: Move to begin
fi: Siirry alkuun

source: Moved one step backwards.
fi: Siirryttiin askel taaksepäin.

source: Moved one step forward.
fi: Siirryttiin eteenpäin.

source: Moving to the line {0}
fi: Siirrytään riville {0}

source: Operator {0}
fi: Operaattori {0}

source: Redo
fi: Siirry eteenpäin

source: Returning the return value
fi: Palautetaan paluuarvo

source: Rewound back to the start.
fi: Siirryttiin takaisin alkuun

source: Stack
fi: Pino

source: Stack frame
fi: Kehys

source: Stack frame, memory area containing the data related to the currently running code.
fi: Kehys, muistialue, jossa on tallessa suoritukseen liittyviä tietoja.

source: Stack, all the stack frames are stored here.
fi: Pino, kaikki kehykset on talletettu tänne.

source: Starting evaluation of the function {0}
fi: Aloitetaan funktion {0} suoritus

source: Starting evaluation of the method {0}
fi: Aloitetaan metodin {0} suoritus

source: Starting the initialization of the collection
fi: Aloitetaan kokoelman alustaminen

source: Step forward
fi: Siirry eteenpäin

source: Text console
fi: Tekstikonsoli

source: Undo
fi: Siirry taaksepäin

source: Value {0}
fi: Arvo {0}

source: Value {0} of type {1}
fi: {1}-tyyppinen arvo {0}

source: Values needed during the execution are stored here.
fi: Suorituksen aikana tarvittavat literaaliarvot ovat täällä.

source: Variable {0}
fi: Muuttuja {0}

source: {0} object, in memory at location {1}
fi: {0}-olio, joka on muistissa kohdassa {1}
