Repository: Aalto-LeTech/jsvee
Catalog: scala/*.po
Languages: fi

source: on line
fi: rivillä

source: , execution ongoing, on line
fi: , suoritus käynnissä, rivillä

source: -operator
fi: -operaattori

source: Addition operator
fi: Yhteenlaskuoperaattori

source: Array apply operator
fi: Taulukostapoimimisoperaattori

source: Array assignment operator
fi: Taulukkoonsijoitusoperaattori

source: Buffer append operator
fi: Puskuriinlisäysoperaattori

source: Buffer apply operator
fi: Puskuristapoimimisoperaattori

source: Buffer assignment operator
fi: Puskuriinsijoitusoperaattori

source: Buffer, located in the memory at
fi: Puskuri, joka on muistissa kohdassa

source: Command to create {0}
fi: {0}-luomiskäsky

source: Comparison operator
fi: Vertailuoperaattori

source: Concatenation operator
fi: Yhdistämisoperaattori

source: Creating function literal
fi: Luodaan funktioliteraali

source: Definition of class constructor for {0}
fi: {0}-luokan konstruktorin määrittely

source: Definition of function {0}
fi: Funktion {0} määrittely

source: Definition of method {0}
fi: Metodin {0} määrittely

source: Definition of type {0}
fi: Tyypin {0} määrittely

source: Division operator
fi: Jakolaskuoperaattori

source: Equality operator
fi: Yhtäsuuruusoperaattori

source: Evaluating
fi: Suoritetaan

source: Evaluating class constructor for {0}
fi: Suoritetaan {0}-luokan konstruktori

source: Evaluating command
fi: Suoritetaan käsky

source: Evaluating command to create {0}
fi: Suoritetaan {0}-luomiskäsky

source: Evaluating function
fi: Suoritetaan funktio

source: Evaluating method
fi: Suoritetaan metodi

source: Fetching
fi: Noudetaan

source: Fetching class constructor for {0}
fi: Noudetaan {0}-luokan konstruktori

source: Fetching command
fi: Noudetaan käsky

source: Fetching command to create {0}
fi: Noudetaan {0}-luomiskäsky

source: Fetching expression {0}
fi: Noudetaan lauseke {0}

source: Fetching function
fi: Noudetaan funktio

source: Fetching function
fi: Noudetaan funktio

source: Fetching method
fi: Noudetaan metodi

source: Fetching reference to data, located in memory at {0}
fi: Noudetaan viittaus tietoon, joka on muistissa kohdassa {0}

source: Fetching reference to object, located in memory at {0}
fi: Noudetaan viittaus olioon, joka on muistissa kohdassa {0}

source: Fetching value {0}
fi: Noudetaan arvo {0}

source: Frame
fi: Kehys

source: Frame, execution unfinished
fi: Kehys, suoritus kesken

source: Inequality operator
fi: Erisuuruusoperaattori

source: Multiplication operator
fi: Kertolaskuoperaattori

source: Package object
fi: Pakkausolio

source: Starting evaluation of class constructor for {0}
fi: Aloitetaan {0}-luokan konstruktorin suoritus

source: Starting evaluation of command to create {0}
fi: Aloitetaan {0}-luomiskäskyn suoritus

source: Starting evaluation of function
fi: Aloitetaan funktion suoritus

source: Starting evaluation of function {0}
fi: Aloitetaan funktion {0} suoritus

source: Starting evaluation of method {0}
fi: Aloitetaan metodin {0} suoritus

source: String, located in the memory at
fi: Merkkijono, joka on muistissa kohdassa

source: Subtraction operator
fi: Vähennyslaskuoperaattori

source: Trait
fi: Piirreluokka

source: Unevalued parameter
fi: Evaluoimaton parametriarvo

source: Unit, empty return value
fi: Unit, tyhjä palautusarvo

source: Vector apply operator
fi: Vektoristapoimimisoperaattori

source: Vector assignment operator
fi: Vektoriinsijoitusoperaattori

source: addition operator
fi: yhteenlaskuoperaattori

source: array apply operator
fi: taulukostapoimimisoperaattori

source: array assignment operator
fi: taulukkoonsijoitusoperaattori

source: buffer append operator
fi: puskuriinlisäysoperaattori

source: buffer apply operator
fi: puskuristapoimimisoperaattori

source: buffer assignment operator
fi: puskuriinsijoitusoperaattori

source: comparison operator
fi: vertailuoperaattori

source: concatenation operator
fi: yhdistämisoperaattori

source: definition of buffer creation command
fi: Puskurin luomiskäskyn määrittely

source: definition of println subroutine
fi: println-aliohjelman määrittely

source: division operator
fi: jakolaskuoperaattori

source: equality operator
fi: yhtäsuuruusoperaattori

source: execution unfinished
fi: suoritus kesken

source: inequality operator
fi: erisuuruusoperaattori

source: multiplication operator
fi: kertolaskuoperaattori

source: subtraction operator
fi: vähennyslaskuoperaattori

source: unnamed function
fi: nimetön funktio

source: vector apply operator
fi: vektoristapoimimisoperaattori

source: vector assignment operator
fi: vektoriinsijoitusoperaattori
